---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePatternRotationAngle
source: html/30077928-b0f9-1331-d85f-110fb1470656.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePatternRotationAngle Property

"Component Rotation"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfacePatternRotationAngle { get; }
```